app.factory('levelSRV', function () { //TODO переписать на получение JSON
    return {
        1: {
            codename: "introduction",
            inputArray : [1, 14, 20, 88],
            expectations : [1, 14, 20, 88],
            description : 'Смотрите сюда, тут описание задания. Самые первые изучаемые команды это INP и OUT.' +
                'Они отвечают за получение и выводинформации. INP [to] записывает следующее по списку число ' +
                'в регистр [to]. OUT [from] выводит данные из регистра [from]. В первом задании необходимо просто' +
                'считать данные с помощью INP и вывести их с помощью OUT'
        },
        2: {
            codename: "mov",
            inputArray : [4, 3],
            expectations : [4, 3, 4, 3],
            description : 'Следующая команда, это команда копирования MOV [to] [from]. Команда берет значение из [from]' +
                'и записывает его в [to]'
        },
        3: {
            codename: "fractal",
            inputArray : [2, 3, 6, 4, 7],
            expectations : [1, 2, 8, 3, 13],
            description : 'линейная рекуррентная последовательность натуральных чисел,' +
                ' где первое и второе равно единице, а каждое последующее — сумме двух предыдущих:' +
                ' 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233, 377…' +
                'Выведите число фибоначчи, соответсвующее порядковому номеру в последовательности.'
        }
    };
});