app.factory('levelSRV', function () {
    return {
        1: {
            inputArray : [1, 14, 20, 88],
            expectations : [1, 14, 20, 88],
            description : 'Смотрите сюда, тут описание задания. Самые первые изучаемые команды это INP и OUT.' +
                'Они отвечают за получение и вывод информации. INP [to] записывает следующее по списку число ' +
                'в регистр [to]. OUT [from] выводит данные из регистра [from]. В первом задании необходимо просто' +
                'считать данные с помощью INP и вывести их с помощью OUT'
        },
        2: {
            inputArray : [4, 3],
            expectations : [4, 3, 4, 3],
            description : 'Следующая команда, это команда копирования MOV [to] [from]. Команда берет значение из [from]' +
                'и записывает его в [to]'
        },
        3: {
            inputArray : [1, 14, 20, 88],
            expectations : [15, 108],
            description : 'Следующая команда, это команда сложения ADD [to] [from]. Команда берет значение из [from]' +
                ', прибавляет его к значению [to] из записывает обратно в [to]'
        }
    };
});
